Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: དོན་དམ་པར་ཡང་དག་པའི་སྤོང་བ་ལ་སོགས་པའི་མཚན་ཉིད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པས་ཡང་དག་པའི་སྤོང་བ་ལ་སོགས་པ་དམིགས་སུ་མེད་པའི་ངོ་བོ་ཉིད་དུ་ཡོངས་སུ་མཁྱེན་པ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་རྣམས་ཡོངས་སུ་རྫོགས་པར་མཛད་དོ་ཞེས་བཤད་དོ།
en: Hence, understanding that the right efforts and so on have an intrinsic nature that cannot be apprehended, they, “having stood in the perfection of wisdom, … perfect” the dharmas on the side of awakening. “

source: །སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་བསྒོམ་པར་བྱའོ་ཞེས་བྱ་བ་ལ་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ནི་མྱ་ངན་ལས་འདས་པ་ཐོབ་པར་བྱེད་པ་ཡིན་པའི་ཕྱིར།
en: They should cultivate the emptiness meditative stabilization.”

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་བསྒོམ་པ་དང་མཐུན་པས་ན་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཉིད་ཀྱི་ནང་དུ་བགྲང་ངོ་།
en: The three doors to liberation cause the attainment of nirvāṇa so they are in harmony with the cultivation of the dharmas on the side of awakening and are counted among the dharmas on the side of awakening.

source: །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐབས་སུ་གཏོགས་པས་ཏིང་ངེ་འཛིན་གསུམ་ཞེས་བརྗོད་དོ།
en: These are included in the bodhisattva stage so they are called “the three meditative stabilizations.”

source: །དེ་ལ་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་ཀུན་བརྟགས་པའི་མཚན་ཉིད་ཀྱིས་སྟོང་པ་ལ་ཀུན་བརྟགས་པའི་རྣམ་པ་དེས་སྟོང་ངོ་ཞེས་སྟོང་པའི་རྣམ་པར་བསྒོམ་པ་ན་སེམས་རྩེ་གཅིག་པ་ཉིད་དུ་གྱུར་པ་ལ་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ཞེས་བྱའོ།
en: Among them, in regard to “the emptiness meditative stabilization,” that which is marked as the thoroughly established is empty of that which is marked as the falsely imagined. When it is cultivated as the empty aspect, “it is empty of those falsely imagined aspects,” and the mind has become single-pointed; this is “the emptiness meditative stabilization.”

source: །བརྗོད་དུ་མེད་པའི་དོན་དམ་པ་དེ་ཉིད་ནམ་མཁའ་བཞིན་དུ་གཟུགས་ལ་སོགས་པའི་མཚན་མ་ཐམས་ཅད་དང་བྲལ་བ།
en: Just that inexpressible ultimate, like space, separated from all the causal signs of form and so on, marked as the nonexistence of any aspect of a causal sign is the calming of all elaborations.

source: མཚན་མའི་རྣམ་པ་མེད་པའི་མཚན་ཉིད་སྤྲོས་པ་ཐམས་ཅད་ཉེ་བར་ཞི་བ་ཡིན་པས་ཞི་བའི་རྣམ་པར་བསྒོམ་པ་ན་སེམས་རྩེ་གཅིག་ཏུ་གྱུར་པ་ལ་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་ཞེས་བྱའོ།
en: When it is cultivated as the calm aspect, and the mind has become single-pointed, it is “the signlessness meditative stabilization.”

source: །དེ་བཞིན་དུ་ཁམས་གསུམ་པ་རྣམས་དངོས་པོ་མེད་པ་ངོ་བོ་ཉིད་ཀྱི་རྣམ་པར་གཟིགས་པས་ཆོས་ཐམས་ཅད་ལ་མི་མཐུན་པའི་འདུ་ཤེས་ཉེ་བར་བཞག་ནས།
en: Similarly, on account of seeing the three realms in their nonexistent intrinsic nature aspect, all dharmas come to be perceived as discordant.

source: ཕྱི་མ་ལ་སྨོན་པའི་གནས་སུ་མི་བྱེད་པར་ཡང་དག་པར་རྗེས་སུ་གཟིགས་པ་ན་སེམས་རྩེ་གཅིག་ཏུ་གྱུར་པ་ལ་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཞེས་བྱའོ།
en: When the insight that they do not serve as a basis for anything to be wished for in the future has become a single-pointed mind, it is “the wishlessness meditative stabilization.”

source: །དེའི་འོག་ཏུ་བསམ་གཏན་བཞི་དང་ཞེས་བྱ་བ་ལ་སོགས་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་སྤྱོད་པ་བསྟན་ཏེ།
en: Practice without harming that brings beings to maturity Then the practice that brings beings to maturity is taught with “they should cultivate the four concentrations,” and so on.

source: སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དེ་ཡང་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་སྟེ། བསམ་གཏན་དང་ཏིང་ངེ་འཛིན་གྱི་ཕྱོགས་དང་། མངོན་པར་ཤེས་པའི་ཕྱོགས་དང་། ཡེ་ཤེས་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱིས་བྱ་དགོས་པས་ཕྱོགས་ཀྱི་ཆོས་གསུམ་ཆར་ཡང་དེར་འདུས་ཏེ།
en: Those beings who are to be brought to maturity, furthermore, are ordinary beings and extraordinary beings, and the maturing has to be done with the dharmas in the concentration and meditative stabilization class, the clairvoyance class, and the knowledge class, so it includes all three classes.

source: དེ་ལ་བསམ་གཏན་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་དང་པོར་སེམས་ཅན་ལ་ཕན་པར་བྱ་བའི་ཕྱིར་ཀུན་རྫོབ་ཏུ་བཟུང་སྟེ། ཕྱིས་དོན་དམ་པར་ཡོངས་སུ་བཙལ་ནས་བསམ་གཏན་ལ་སོགས་པའི་ངོ་བོ་ཉིད་དུ་མངོན་པར་ཞེན་པར་མི་མཛད་པར་སྙིང་རྗེ་དང་ཐབས་མཁས་པ་གཉིས་ཀྱིས་ཡང་ཀུན་རྫོབ་ཉིད་ལ་དམིགས་ནས་སེམས་ཅན་ལ་ཕན་པར་བྱེད་པའི་ཕྱིར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པའི་སྤྱོད་པ་རྣམ་པར་གཞག་གོ། །དེ་ལ་སྐྱོ་བ་རྗེས་སུ་དྲན་པ་ཞེས་བྱ་བ་ནི། སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་།
en: That is presented as the practice that brings being to maturity because bodhisattvas first conventionally take up all the concentration dharmas, and so on, to work for the benefit of beings, then afterward, having searched for the ultimate, without settling down on the intrinsic nature of the concentrations, and so on, again with both compassion and skillful means take the conventional as their objective support and work for the benefit of beings.

source: ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་དང་། མི་རྟག་པ་དང་། སྟོང་པ་དང་། བདག་མེད་ཅེས་བྱ་བ་ལ་སོགས་པ་ཡིད་བྱུང་བར་འགྱུར་བའི་གནས་རྣམས་ལ་དམིགས་ནས་ཉེས་དམིགས་སུ་མཐོང་བས་སྐྱོ་བ་ཡིན་ལ་བྱེད་པ་ནི་སྐྱོ་བ་རྗེས་སུ་དྲན་པ་ཞེས་བྱའོ།
en: There, in regard to the “mindfulness of disgust,” having taken birth, decay, illness, death, sorrow, lamentation, pain, depression, and grief; the impermanent, the empty, and the selfless and so on—the grounds for repulsion—as the objective support, seeing them as faults and paying attention to the feeling of disgust is “mindfulness of disgust.”

source: །བྱང་ཆུབ་སེམས་དཔའི་སྐྱོ་བ་རྗེས་སུ་དྲན་པ་ནི་ཆོས་ཐམས་ཅད་བདག་མེད་ཅིང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པ་ལས། བྱིས་པ་རྣམས་ཀྱིས་སྙིང་པོ་ཅན་དུ་བློ་བསྐྱེད་དེ་འཇུག་པར་མཐོང་ནས་དེ་དག་ཤེས་པར་བྱ་བ་མྱུར་དུ་སྔོན་དུ་གཏོང་བའི་ཡིད་ལ་བྱེད་པ་ནི་སྐྱོ་བ་རྗེས་སུ་དྲན་པ་ཞེས་བྱའོ།
en: As for a bodhisattva’s mindfulness of disgust, having seen that the foolish generate an awareness of all phenomena as having essences and engage with those even though they are selfless and are the nonexistence of an intrinsic nature, the attention preceded by the thought that they may quickly come to know that is “mindfulness of disgust.” “

source: །སྔར་རྗེས་སུ་དྲན་པ་ཡིད་ལ་བྱེད་པའི་དབང་གིས་འཆི་བ་རྗེས་སུ་དྲན་པ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Mindfulness of death” is spoken of earlier governed by “mindfulness” as paying attention.

source: །ཕྱིས་ལྷག་མཐོང་གི་སྒོ་ནས་འཆི་བའི་ཆོས་ཉིད་ཅན་དུ་མཐོང་བ་ལ་འཆི་བའི་འདུ་ཤེས་ཞེས་གསུངས་སོ།
en: Later, based on special insight, the vision of death in its true dharmic nature is said to be “the perception of death.”

source: །འཇིག་རྟེན་པའི་རིག་པ་དང་། བཟོའི་གནས་ཐམས་ཅད་དང་། སྒྱུ་རྩལ་རྣམ་པ་སྣ་ཚོགས་དྲུག་ཅུ་རྩ་བཞི་ལ་སོགས་པ་ལ་ཡིད་མི་རྟོན་པའི་དགའ་བ་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་སོ།
en: The pleasure of not trusting any ordinary knowledge or craftsmanship, or the sixty-four arts and so on, is “the perception that there is no delight in the entire world.”

source: །ཁམས་གསུམ་པ་ལ་ཆགས་སུ་རུང་བའི་རྒྱུ་ཡང་དག་པར་རྗེས་སུ་མ་གཟིགས་པས་དེ་ལ་འདོད་པ་མེད་པར་གྱུར་པ་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལ་ཡིད་མི་རྟོན་པའི་འདུ་ཤེས་སོ།
en: Not wanting anything in the three realms on account of not seeing any reason to be attached to them is “the perception that there is nothing to trust in the entire world.” “

source: །སྡུག་བསྔལ་ཤེས་པ་བསྒོམ་པར་བྱའོ་ཞེས་བྱ་བ་ནི་ཕུང་པོ་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་ཀུན་རྫོབ་ཀྱི་སྒོ་ནས་སྡུག་བསྔལ་ཉིད་དུ་མཁྱེན་པར་མཛད་ནས་དེའི་འོག་ཏུ་དེ་དག་ཉིད་དོན་དམ་པར་ཤིན་ཏུ་དངོས་པོ་མེད་པར་མཁྱེན་ཀྱང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཀུན་རྫོབ་ཏུ་སྡུག་བསྔལ་གྱི་རྣམ་པ་ཉིད་དུ་མཁྱེན་པ་དང་། གཞན་དག་ལ་ཡང་དེ་བཞིན་དུ་ཤེས་པར་མཛད་པའི་མཁྱེན་པ་ནི་སྡུག་བསྔལ་ཤེས་པ་སྟེ།
en: They should cultivate knowledge of suffering.” Having made known that all dharmas such as the aggregates and so on are, from a conventional perspective, just suffering, then, even while knowing that they are ultimately utterly nonexistent things, in order to bring beings to maturity, knowing them conventionally in just the aspect of suffering and knowing how to make others understand them like that as well is the knowledge of suffering.

source: དེ་བཞིན་དུ་ཐམས་ཅད་ལ་ཡང་སྦྱར་བར་བྱའོ།
en: Construe all the other noble truths similarly.

source: །ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་ལ་སོགས་པ་དེ་དག་ཉིད་རབ་ཏུ་སྐྱེ་བར་མཁྱེན་པ་དང་། དེ་ཤེས་པར་བྱེད་པའི་མཁྱེན་པ་དང་། ཀུན་མཐུན་པར་མཁྱེན་པ་ནི་ཀུན་འབྱུང་བ་ཤེས་པའོ།
en: The knowledge that just those aggregates, constituents, sense fields, and so on are products, the knowledge of how to make that understood, and the knowledge that all are in agreement is “the knowledge of origination.”

source: །བདག་དང་གཞན་རྣམས་ཀྱི་ཉོན་མོངས་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་དང་། སྡུག་བསྔལ་ཐམས་ཅད་དང་། སྲིད་པ་ཡོངས་སུ་ཟད་པ་མཁྱེན་པ་དང་། ཡོངས་སུ་ཟད་པའི་རྒྱུ་མཁྱེན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཟད་པ་ཤེས་པའོ།
en: The knowledge that all their own and others’ afflictions, secondary afflictions, suffering, and existence are extinguished, and the knowledge of what causes them to be completely extinguished, is the bodhisattvas’ “knowledge of extinction.” “[

source: །བདག་དང་གཞན་དག་གི་སྲིད་པའི་སྐྱེ་བར་སྐྱེ་བ་ཐམས་ཅད་མཁྱེན་པ་དང་། མི་སྐྱེ་བའི་རྒྱུ་མཁྱེན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མི་སྐྱེ་བ་ཤེས་པའོ།
en: The] knowledge of not arising” of bodhisattvas is the knowledge of all the arising in their own and others’ births in existence, and the knowledge of what causes them not to arise. “

source: །ཀུན་རྫོབ་ཏུ་ཆོས་ཐམས་ཅད་མངོན་སུམ་དུ་མཁྱེན་པ་དང་། དོན་དམ་པའི་དབང་གིས་དེ་བཞིན་ཉིད་དུ་མཁྱེན་པ་ནི་ཆོས་ཤེས་པའོ།
en: Knowledge of dharmas” is direct knowledge of all dharmas as conventions, and, governed by the ultimate, knowledge as suchness. “

source: །ཀུན་རྫོབ་ཏུ་ཆོས་ཐམས་ཅད་རྗེས་སུ་དཔག་པས་ཤེས་པ་དང་། མི་རྟག་པ་ལ་སོགས་པ་མངོན་སུམ་དུ་མ་གྱུར་ཀྱང་དེ་ལྟ་བུར་འགྱུར་བར་མཁྱེན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དུ་རྗེས་སུ་མཐུན་པར་མཁྱེན་པ་ནི་རྗེས་སུ་རྟོགས་པའི་ཤེས་པའོ།
en: Subsequent realization knowledge” is the inferential knowledge of all dharmas as conventions, the knowledge that even though they were not directly perceptible as impermanent, and so on, they are so, and the subsequent knowledge bodhisattvas have that all dharmas are in accord with emptiness.

source: །འཕགས་པ་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་དང་བུམ་པ་ལ་སོགས་པ་མཁྱེན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་གཟུགས་ལ་སོགས་པ་ཀུན་བརྟགས་པའི་ཆོས་ཐམས་ཅད་ལ་དམིགས་པའི་མཁྱེན་པ་ནི་ཀུན་རྫོབ་ཤེས་པའོ།
en: All the nobles’ knowledge of beings and pots and so on, and the bodhisattvas’ knowledge that observes all falsely imagined dharmas such as form and so on, is “conventional knowledge.” “

source: །ཡོངས་སུ་འདྲིས་པ་ཤེས་པ་ཞེས་བྱ་བ་ནི་ཤེས་པ་གང་གིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སྒོམ་ཡང་མྱ་ངན་ལས་འདས་པ་མངོན་སུམ་དུ་མི་མཛད་ཀྱི་དེ་དག་ཉིད་གོམས་པ་དང་། རབ་ཏུ་བྱང་བ་འབའ་ཞིག་མཛད་པའི་མཁྱེན་པ་དེ་ལ་ཡོངས་སུ་འདྲིས་པ་ཤེས་པ་ཞེས་བྱའོ།
en: Knowledge of mastery”— the knowledge with which bodhisattvas cultivate the three gateways to liberation—emptiness, signlessness, and wishlessness,—and the dharmas on the side of awakening, without actualizing nirvāṇa, the knowledge that causes only the habituation to and purification of them, is “knowledge of mastery.”

source: །གལ་ཏེ་མྱ་ངན་ལས་འདས་པ་མངོན་སུམ་དུ་མཛད་ན་ནི་དེ་རྒྱུན་དུ་ཞུགས་པ་ལ་སོགས་པ་ཉིད་དུ་འགྱུར་ཏེ། དེས་དོགས་པའི་ཕྱིར་ཡང་དག་པའི་མཐའ་ལ་རེག་པར་མི་མཛད་ཀྱི།
en: Were they to actualize nirvāṇa they would become stream enterers and so on, but because they fear that, they do not touch the very limit of reality.

source: མཁྱེན་པ་དེས་ཆོས་ཙམ་དུ་བསྒོམ་པར་མཛད་དོ།
en: With that knowledge they cultivate them as mere dharmas.

source: །འོ་ན་མྱ་ངན་ལས་འདས་པ་ཐོབ་པར་བྱེད་པའི་ཆོས་རྣམས་བསྒོམས་པས། ཇི་ལྟར་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་མཛད་པར་མི་འགྱུར་ཞེ་ན།
en: Qualm: But how could they have cultivated dharmas that cause them to reach nirvāṇa and yet still not have actualized the very limit of reality?

source: སྐྱོ་བ་ཡིད་ལ་བྱེད་པ་དང་མི་ལྡན་པའི་ཕྱིར་རོ་ཞེས་སྔར་ཡང་བཤད་དོ།
en: As explained earlier, it is because they do not “pay attention to the feeling of disgust.”

source: །གཞན་ཡང་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་བྱེད་པའི་སྔོན་དུ་འགྲོ་བ་ནི་ཞི་གནས་དང་ལྷག་མཐོང་སྒོམ་པ་ཡིན་ན།
en: Furthermore, the precursor to the actualization of the very limit of reality is the cultivation of calm abiding and special insight.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་དེ་ལྟར་ཡང་དག་པའི་མཐའ་འཐོབ་པར་བྱེད་པའི་ཞི་གནས་དང་།
en: Bodhisattvas, however, do not practice a cultivation of such calm abiding and special insight that would cause them to reach the very limit of reality.

source: ལྷག་མཐོང་བསྒོམ་པ་ལ་སྦྱོར་བ་མི་མཛད་ཀྱི་ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པར་བསྒོམ་པ་རྒྱས་པར་བྱ་བ་འབའ་ཞིག་གི་ཕྱིར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་དམིགས་པ་ན་མཉམ་པར་མ་བཞག་པའི་ཤེས་པ་ཐ་མལ་པས་སོ་སོར་རྟོག་གོ།
en: Since theirs is only the vast cultivation of all dharmas without apprehending them, when they observe the dharmas on the side of awakening they understand them, unabsorbed, with an ordinary knowledge.

source: །དེ་བས་ན་ཞི་གནས་དང་ལྷག་མཐོང་གི་རྐྱེན་དང་མི་ལྡན་པའི་ཕྱིར་ཡང་དག་པའི་མཐའ་མངོན་སུམ་དུ་མཛད་པར་མི་འགྱུར་རོ།
en: Therefore, since they do not have the conditions for that calm abiding and special insight, they do not actualize the very limit of reality.

source: །འདི་ལྟར་འོག་ནས་ཀྱང་རབ་འབྱོར་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པའི་སྟོང་པ་ཉིད་ལ་སོ་སོར་རྟོག་ཀྱང་མངོན་སུམ་དུ་བྱའོ་སྙམ་པས་སོ་སོར་རྟོག་པར་མི་བྱེད་ཀྱི།
en: Thus, later the Lord will again say, “Subhūti, when bodhisattva great beings contemplate emptiness furnished with the best of all aspects, they do not contemplate that they should actualize it; rather, they contemplate that they should master it. They contemplate that it is not the time it should be actualized, but rather it is the time it should be mastered.

source: འདི་ནི་ཡོངས་སུ་འདྲིས་པར་བྱ་བའི་དུས་ཡིན་གྱི་མངོན་དུ་བྱ་བའི་དུས་ནི་མ་ཡིན་ནོ་ཞེས་སོ་སོར་རྟོག་ཅིང་མཉམ་པར་མ་བཞག་པ་ཉིད་དུ་དམིགས་པ་ལ་སེམས་ཉེ་བར་འདོགས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བར་སྐབས་དེར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལས་ཉམས་པར་ཡང་མི་འགྱུར་ལ། ཟག་པ་ཟད་པ་མངོན་སུམ་དུ་ཡང་མི་བྱེད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པ་འཆད་དོ།
en: When not in actual meditative equipoise, bodhisattva great beings attach their minds to an objective support and without letting the dharmas on the side of awakening lessen, in the meantime do not actualize the extinction of outflows,” and so on. “

source: །སྒྲ་ཇི་བཞིན་ཤེས་པ་ཞེས་བྱ་བ་ནི་སྒྲ་གང་དང་གང་ཡིན་པ་ལ་སྒྲ་ཇི་བཞིན་ཞེས་བྱའོ།
en: Knowledge in accord with sound”— any language whatsoever is “in accord with sound.”

source: །དེ་ཤེས་པ་ནི་སྒྲ་ཇི་བཞིན་ཤེས་པ་སྟེ།
en: Knowledge of that is “knowledge in accord with sound.”

source: ཤེས་པ་གང་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་། {ཡི་དགས་,ཡི་དྭགས་}དང་། ལྷ་དང་མི་དང་ཚངས་པ་ཐམས་ཅད་ཀྱི་སྒྲ་དང་སྐད་ཐམས་ཅད་སོ་སོར་རྟོགས་ཤིང་མཁྱེན་པ་དེ་ནི་སྒྲ་ཇི་བཞིན་ཤེས་པའོ།
en: So, knowledge in accord with sound is the knowledge with which bodhisattvas have an understanding and knowledge of all the languages and speech of hell beings, animals, ghosts, gods, humans, and Brahmās.

source: །ཐམས་ཅད་ལ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་ཞེས་བྱ་བར་སྦྱར་བས་དམིགས་སུ་མེད་པའི་ཚུལ་གྱིས་སྒོམ་པར་བྱེད་ཅེས་བྱ་བར་ཤེས་པར་བྱའོ།
en: All of these are taken together with “having stood in the perfection of wisdom,” so understand that all are cultivated without taking any as a real basis.

source: །དེ་བས་ན་འབུམ་པ་ལ་སོགས་པ་ཐམས་ཅད་དུ་ཡང་དེ་བཞིན་དུ་སྟོན་ཏོ།
en: Therefore, the One Hundred Thousand and so on spell it out like that in every case. “

source: །མ་ཉམས་པའི་མངོན་པར་ཤེས་པ་ལྔ་ཞེས་བྱ་བ་ནི་འགྲོ་བའི་འཆི་འཕོ་དང་སྐྱེ་བ་ཐམས་ཅད་དུ་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པས་མངོན་པར་ཤེས་པ་ཉམས་པ་མེད་པའི་ཕྱིར།
en: The five undiminished clairvoyances”— because they are in possession of the five clairvoyances in all deaths and births in all forms of life, they have clairvoyances that do not decline, so they are “undiminished.” “

source: མ་ཉམས་པ་ཞེས་བྱའོ། །ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཅེས་བྱ་བ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྔར་བཤད་ཟིན་མོད་ཀྱི་འོན་ཀྱང་འདིར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྐབས་སུ་གཏོགས་པར་ཡང་བཤད་དོ།
en: The six perfections”— it is true that the six perfections have already been spoken about before, nevertheless here it speaks about them again in the context of bringing beings to maturity. “

source: །ཡང་དག་པར་སྡུག་པར་འགྱུར་བའི་ཆོས་དྲུག་ཅེས་བྱ་བ་ནི་འབུམ་པ་ལས་འབྱུང་སྟེ།
en: The six principles of being liked”— these six principles are in the One Hundred Thousand.

source: བྱམས་པའི་ལུས་ཀྱི་ལས་དང་། བྱམས་པའི་ངག་གི་ལས་དང་། བྱམས་པའི་ཡིད་ཀྱི་ལས་དང་། ཚུལ་ཁྲིམས་མཉམ་པ་ཉིད་དང་། ལྟ་བ་མཉམ་པ་ཉིད་དང་། འཚོ་བ་མཉམ་པ་ཉིད་ནི་ཡང་དག་པར་སྡུག་པར་འགྱུར་བའི་ཆོས་དྲུག་གོ།
en: They are kindly physical action, kindly verbal action, kindly mental action, a balanced morality, a balanced view, and a balanced livelihood. “

source: །ནོར་བདུན་ཞེས་བྱ་བ་ནི། དད་པ་དང་། ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། གཏོང་བ་དང་།
en: The seven riches” are faith, morality, learning, giving away, wisdom, a sense of shame, and a sense of compunction. “

source: ཤེས་རབ་དང་། ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པའི་ནོར་རྣམས་སོ། །སྐྱེས་བུ་ཆེན་པོའི་རྣམ་པར་རྟོག་པ་བརྒྱད་ཅེས་བྱ་བ་ལ་ཉན་ཐོས་ཀྱི་རྣམ་པར་རྟོག་པ་རྣམས་ནི་ཇི་སྐད་དུ་རྣམ་འགྲེལ་ལས་བཤད་པ་བཞིན་ནོ། །བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་རྟོག་པ་ནི་ནམ་ཞིག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་སེལ་ནུས་སྙམ་དུ་རྣམ་པར་རྟོག་པ་དང་། ནམ་ཞིག་དབུལ་བས་ཉེན་པ་སེམས་ཅན་འབྱོར་པ་ཆེན་པོ་ལ་འཇོག་ནུས་སྙམ་དུ་རྣམ་པར་རྟོག་པ་དང་། ནམ་ཞིག་ཤ་ཁྲག་དང་བཅས་པའི་ལུས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་ནུས་སྙམ་དུ་རྣམ་པར་རྟོག་པ་དང་། སེམས་ཅན་དམྱལ་བ་ན་ཡུན་རིང་པོར་གནས་པས་ཀྱང་ནམ་ཞིག་སེམས་ཅན་རྣམས་ལ་ཕན་པ་བྱེད་པ་འབའ་ཞིག་ཏུ་འགྱུར་སྙམ་དུ་རྣམ་པར་རྟོག་པ་དང་། ནམ་ཞིག་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་འབྱོར་པས་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་རེ་བ་ཡོངས་སུ་རྫོགས་པར་མཐོང་བར་འགྱུར་སྙམ་དུ་རྣམ་པར་རྟོག་པ་དང་། ནམ་ཞིག་སངས་རྒྱས་སུ་གྱུར་ནས། སེམས་ཅན་ཐམས་ཅད་འཁོར་བའི་སྡུག་བསྔལ་ཐམས་ཅད་ལས་ཡང་དག་པར་འབྱིན་པར་འགྱུར་སྙམ་དུ་རྣམ་པར་རྟོག་པ་དང་། སེམས་ཅན་ལ་ཕན་འདོགས་པ་མེད་པའི་སྐྱེ་བ་དང་། སེམས་ཅན་གྱི་དོན་དུ་སྦྱོར་བ་མེད་པའི་སེམས་དང་། དོན་དམ་པའི་རོ་གཅིག་པུ་ལ་སྤྱོད་པ་དང་། སྐྱེ་བོ་ཐམས་ཅད་སིམ་པར་བྱེད་པའི་ཚིག་མ་ཡིན་པ་དང་། གཞན་ལ་མི་ཕན་པའི་འཚོ་བ་དང་། གཞན་ལ་ཕན་བྱེད་མི་ནུས་པའི་ལུས་དང་།
en: The eight ways great persons think”— the ways śrāvakas think are as explained in the Subcommentary.

source: གཞན་ལ་ཕན་འདོགས་པ་ལ་མི་གསལ་བའི་བློ་དང་། སེམས་ཅན་ལ་ཕན་པར་མི་སྤྱོད་པའི་ནོར་དང་། འགྲོ་བ་རྣམས་ཀྱི་དོན་སྤྱོད་པ་མེད་པའི་དབང་ཕྱུག་དང་། གཞན་ལ་གནོད་པ་བྱེད་པར་དགའ་བར་ཚེ་རབས་ཚེ་རབས་སུ་མ་གྱུར་ཅིག་སྙམ་དུ་རྣམ་པར་རྟོག་པ་དང་། སྲོག་ཆགས་ཐམས་ཅད་ཀྱི་སྡིག་པའི་ལས་ཐམས་ཅད་ཀྱི་འབྲས་བུ་བདག་ལ་སྨིན་པ་བདག་གིས་ལེགས་པར་སྤྱད་པའི་འབྲས་བུ་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་ལ་སྨིན་པར་གྱུར་ཅིག་སྙམ་དུ་རྣམ་པར་རྟོག་པ་སྟེ།
en: As for the way bodhisattvas think, they think, “At some point may I be able to eliminate all the suffering of all beings”; they think, “At some point may I be able to establish in prosperity those who are suffering from poverty”; they think, “At some point may I be able to look after the needs of beings with the flesh and blood of my own body”; they think, “Even if I live long among the denizens of the hells may I at some point only be of benefit to those beings”; they think, “With the ordinary and extraordinary endowments may I at some point come to see the hopes of the whole world fulfilled”; they think, “At some point, having become a buddha, may I deliver all beings from all the sufferings of saṃsāra”; they think, “In lifetime after lifetime may I never have a birth in which I am of no use to beings, a thought that is unconnected with the welfare of beings, a taste for the ultimate alone, meaningless words that do not satisfy all beings, a livelihood that does not benefit others, a body incapable of benefiting others, an awareness that does not illuminate what is of aid to others, wealth that is not used for the benefit of others, a position of importance in society that is not held for the sake of others, and a liking for causing harm to others”; and they think, “May all the results of evil deeds done by all other creatures come to fruition in me, and may all the results of my good conduct come to fruition in all beings.”

source: འདི་དག་ནི་སྐྱེས་བུ་ཆེན་པོའི་རྣམ་པར་རྟོག་པ་བརྒྱད་དོ།
en: These are “the eight ways great persons think.”

source: །དེ་ལྟར་རྣམ་པར་རྟོག་པ་ན་རྣམ་པར་རྟོག་པ་དེ་དག་འབྲས་བུ་ཡོད་པར་བྱ་བའི་ཕྱིར་སྙིང་རྗེས་འཇིག་རྟེན་པ་རྣམས་ལ་བལྟས་ནས་གཞན་ལ་ཕན་པ་བསྒྲུབ་པར་བྱ་བའི་ཕྱིར་དང་། ཤེས་རབ་ཀྱིས་མི་དམིགས་པ་ཡིད་ལ་བྱེད་པ་བསྒོམ་པར་བྱ་བའི་ཕྱིར་དང་། སེམས་ཅན་གྱི་འཇིག་རྟེན་དང་སྣོད་ཀྱི་འཇིག་རྟེན་ཡོངས་སུ་བཙལ་བར་བྱ་བའི་ཕྱིར་སེམས་ཅན་གྱི་གནས་དགུ་བསྒོམ་པར་བྱའོ།
en: When thinking in that way, they should meditate on “the nine places beings live” so that those eight ways of thinking will bear fruit; so that, having viewed the world with compassion, they will bring about a benefit for others; so that, with wisdom, they will develop attention to not apprehending anything; and so that they will thoroughly understand the container world and its inhabitants.

source: །ཁ་ཅིག་ལས་ནི་སེམས་ཅན་ལ་ཀུན་ནས་མནར་སེམས་ཀྱི་དངོས་པོ་དགུ་ཞེས་འབྱུང་ངོ་།
en: Some say, “the nine things that cause anguish to beings.”

source: །ཀུན་ནས་མནར་སེམས་ཀྱི་དངོས་པོ་དགུ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ལ་ཤིན་ཏུ་མི་འབྱུང་བས་དེ་ལས་བཟློག་ནས་ཀུན་ནས་མནར་སེམས་མེད་པའི་དངོས་པོ་དགུར་འགྱུར་ཏེ།
en: Bodhisattvas are totally without “the nine things that cause anguish,” so they become the opposite, the nine things that cause no anguish at all.

source: འདིས་བདག་ལ་གནོད་པ་བྱས་སོ་སྙམ་ནས་ཀུན་ནས་མནར་སེམས་མི་འབྱུང་བ་དང་།
en: Construe them this way: They are not caused anguish by the thought, “That one hurt me.”

source: བྱེད་དོ་སྙམ་ནས་ཀུན་ནས་མནར་སེམས་མི་འབྱུང་བ་དང་།
en: They are not caused anguish by the thought, “That one is hurting me.”

source: བྱེད་པར་འགྱུར་རོ་སྙམ་ནས་ཀུན་ནས་མནར་སེམས་མི་འབྱུང་བ་ལ་སོགས་པར་སྦྱར་རོ།
en: They are not caused anguish by the thought, “That one will hurt me,” and so on.

source: །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ཞེས་བྱ་བ་ལ་སོགས་པས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་སྤྱོད་པ་བསྟན་ཏོ།
en: Practice that brings the buddhadharmas to maturity After that, with “the ten tathāgata powers,” and so on, it teaches the practice that brings the buddhadharmas to maturity.

source: །ཚད་མེད་པ་བཞི་ཞེས་སྔར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྐབས་སུ་བསྟན་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྤྱོད་པ་བསྟན་པའི་སྐབས་སུ་ནི་བྱམས་པ་ཆེན་པོ་ཞེས་བྱ་བ་ལ་སོགས་པ་མིང་གཞན་གྱིས་བསྟན་ཏོ།
en: Since it has taught the four immeasurables before in the context of bringing beings to maturity, in the context of the practices that bring the buddhadharmas to maturity it teaches them with the different names— “great compassion,” and so on.

source: །དེ་ལྟར་མདོར་བཤད་པར་ཆོས་ཐམས་ཅད་བསྡུས་ཏེ་བསྟན་ནས་ད་ནི་རྒྱས་པར་བཤད་པར་བྱ་བ་ལ།
en: Detailed Teaching Having thus brought together all the dharmas and taught them in a brief exposition, now they have to be explained in detail.

source: གང་སྔར་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པས་ཤེས་པར་བྱ་བ་སྨོས་པས་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་བསྟན་ཏོ།
en: Earlier, by speaking about what has to be known by those “who want to fully awaken to all dharmas in all forms,” it indicated the intention of bodhisattvas.

source: །ད་ནི་བསམ་པ་དེ་ཉིད་ཀྱི་རྒྱུ་དང་། འབྲས་བུ་དང་བསམ་པ་དང་བཅས་པ་ལ་སོགས་པས་རྒྱས་པར་རྣམ་པར་ཕྱེ་སྟེ་བསྟན་པར་བཞེད་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པ་ཞེས་བྱ་བ་ལ་སོགས་པས་བསམ་པ་རྣམ་པར་དབྱེ་བ་བསྟན་ཏོ།
en: Now, wanting to give a detailed teaching of the cause and result of that same intention, together with those who have the intention and so on, the Lord again, with those “who want to fully awaken to the knowledge, furnished with the best of all aspects, of a knower of all aspects,” and so on, gives a detailed teaching about the intention.

source: །སྔར་གང་ཞེས་བྱ་བ་བསྟན་པ་རྣམ་པ་བརྒྱད་བསྟན་པ་ལས་གང་གི་ཕྱིར་བརྩོན་པར་བྱ་ཞེས་བྱ་བའི་གང་ཞེས་བྱ་བ་བསྟན་པ་དེ་ད་བསྟན་པར་བྱ་སྟེ།
en: Why bodhisattvas endeavor Now the “why” taught previously, where it says in the exposition in eight parts “why bodhisattvas endeavor”—that “why” has to be explained.

source: འདི་ལ་རིམ་པ་ཇི་ལྟ་བུར་ཞེ་ན།
en: What stages does it have?
